validation/expValidation/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     blastFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5e-3;

deltaT          1e-8;

writeControl    adjustableRunTime;

writeInterval   1e-5;

cycleWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       1;


// ************************************************************************* //


functions
{
    pressureProbes
    {
        type            probes;
        functionObjectLibs ("libsampling.so");
        writeCoontrol   timeStep;
        writeInterval   10;
		interpolate true;
		interpolationScheme cellPointFace;
        probeLocations
        (
            (0.001 0.106 0.0) // AB-1
            (0.45 0.253 0.0) // AB-2
            (1.35 0.253 0.0) // AB-3
            (1.99 0.181 0.0) // AB-4
            (2.61 0.181 0.0) // AB-5
            (3.37 0.018 0.0) // AB-6
            (3.30 0.001 0.0) // AB-7
            (4.37 0.018 0.0) // AB-8
            (4.30 0.001 0.0) // AB-9
            (5.30 0.181 0.0) // AB-10
            (5.61 0.181 0.0) // AB-11
//             (7.60 0.181 0.0) // AB-12
//             (8.80 0.181 0.0) // AB-13
//             (10.60 0.181 0.0) // AB-15
//             (13.80 0.181 0.0) // AB-17
        );
        fields
        (
            p
        );
    }
}



