validation/expValidation/0/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }


    walls
    {
        type            zeroGradient;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }
	    //
    // outlet
    //   {
    // 		  type fixedValue;
    // 		  value 1e5;
    //
    //       // type            waveTransmissive;
    //       // value           uniform 1e5;    //important for correct I/O
    //       // field           p;                //the name of the field that we are working on
    //       // gamma           1.4;              //the ratio of specific heats
    //       // phi             phi;             //the name of the volumetric flux field ( or if you use the mass flux phi, it will be divided
    //       // rho             rho;              //the name of the density field
    //       // psi             psi;              //the name of the field that is the deriv. of density with respect to pressure
    //       // lInf            0.05;             //a measure of how far away the far-field condition should be
    //       // fieldInf        1e5;            //the far-field value to be applied to p
    //   }

}

// ************************************************************************* //
