validation/expValidation/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U ( 0 0 0 )
    volScalarFieldValue p 100000
    volScalarFieldValue alpha.c4 0
    volScalarFieldValue rho.c4 1601
    volScalarFieldValue rho.air 1.225
);

regions
(
    sphereToCell
    {
        centre (0.900 0 0);
        radius 0.0255;

        fieldValues
        (
            volScalarFieldValue alpha.c4 1
        );
    }
);


// ************************************************************************* //
